Emsloan/arduino-tests/Boards Menu Options/boards.txt
# See: https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5-3rd-party-Hardware-specification

menu.chip=Chip

##############################################################

################################
#  AVR-DB Settings             #
################################


# Parameters and defaults for DB parts 
avrdb.upload.tool=avrdude
avrdb.upload.prog_interlock=
avrdb.build.board=avrdb
avrdb.build.core=dxcore
avrdb.build.f_cpu={build.speed}000000L
avrdb.build.text_section_start=.text=0x0
avrdb.build.extra_flags= {bootloader.appspm}
avrdb.build.export_merged_output=false
avrdb.build.mcupostfix=
avrdb.build.printf=
avrdb.build.wireabr=

# Bootloading parameters and fuses       
avrdb.bootloader.tool=avrdude
avrdb.bootloader.WDTCFG=0x00
avrdb.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
avrdb.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrdb.bootloader.SYSCFG1=0b000{bootloader.mviobits}{bootloader.sutbits}
#avrdb.bootloader.SYSCFG1=0b00001{bootloader.sutbits}
avrdb.bootloader.CODESIZE=0x00
avrdb.bootloader.BOOTSIZE=0x01
avrdb.bootloader.avrdudestring=
avrdb.bootloader.pymcuprogstring=-aerase


# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #

avrdb.build.mcupostfix=
avrdb.build.printfabr=
avrdb.build.attachabr=
avrdb.build.wireabr=
avrdb.build.appspmabr=.spm{bootloader.CODESIZE}


# AVR-DB submenu options                     

# Chip (memory and pincount)             
avrdb.menu.chip.avr128db48=AVR128DB48
avrdb.menu.chip.avr128db48.build.mcu=avr128db48
avrdb.menu.chip.avr128db48.upload.maximum_size=131072
avrdb.menu.chip.avr128db48.upload.maximum_data_size=16384
avrdb.menu.chip.avr128db48.build.variant=48pin-standard


# Clock Speed + Source options
avrdb.build.f_cpu=24000000L
avrdb.build.speed=24
avrdb.build.clocksource=0

# BrownOut Detection (BOD) Options
avrdb.bootloader.bodlevbits=000


# Retain EEPROM (EESAVE)                 
avrdb.bootloader.eesavebit=1

# Reset pin as GPIO option             
avrdb.bootloader.resetpinbits=10

# attachInterrupt Mode                   
avrdb.build.attachmode=-DCORE_ATTACH_ALL


# MVIO menu                              
avrdb.bootloader.mviobits=01


# Startup time options  
# Default set to 8 ms                 
avrdb.bootloader.sutbits=100

# SPM            

avrdb.bootloader.appspm=
avrdb.bootloader.BOOTSIZE=0x00


###################################################
# Optional Menu Section                           #
###################################################

# Uncomment desired Option, save, and restart the Arduino IDE for selected 
# option to be shown.

# Uncomment lines with only one '#' 

##### Default settings for options (1,2,5) ###############################
##### Must be commented out to use Option 3, 4  ##########################  
##### Uncomment if using options (,2,5) ##################################

#avrda.upload.tool=avrdude
#avrda.upload.prog_interlock=
#avrda.build.board=avrda
#avrda.build.core=dxcore
#avrda.build.text_section_start=.text=0x0
#avrda.build.export_merged_output=false
#avrda.build.mcupostfix=
#avrda.build.printf=
#avrda.build.printfabr=
#avrda.build.attachabr=
#avrda.build.wireabr=
#avrda.build.appspmabr=.spm{bootloader.CODESIZE}
#avrda.bootloader.tool=avrdude
#avrda.bootloader.WDTCFG=0x00
#avrda.bootloader.BODCFG={bootloader.bodlevbits}{bootloader.bodmodebits}
#avrda.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
#avrda.bootloader.CODESIZE=0x00
#avrda.bootloader.BOOTSIZE=0x01
#avrda.bootloader.avrdudestring=
#avrda.bootloader.pymcuprogstring=-aerase
#avrda.bootloader.appspm=
#avrda.bootloader.BOOTSIZE=0x00
#avrda.menu.chip.128DA48=AVR128DA48
#avrda.menu.chip.128DA48.build.mcu=avr128da48
#avrda.menu.chip.128DA48.upload.maximum_size=131072
#avrda.menu.chip.128DA48.upload.maximum_data_size=16384
#avrda.menu.chip.128DA48.build.variant=48pin-standard
#avrda.build.f_cpu=24000000L
#avrda.build.speed=24
#avrda.bootloader.bodlevbits=000
#avrda.bootloader.eesavebit=1
#avrda.bootloader.resetpinbits=10
#avrda.bootloader.SYSCFG1=0x04

########## End of Section to comment out if using Option 3 or 4 ################

#############
# Option 1  #
#############
########## OPTION 1 (Defaults Only, No extra menu options) ################

##### BOARD NAMES #####

#avrda.name=AVR128DA48 Curiosity Nano
#avrdb.name=AVR128DB48 Curiosity Nano

##### AVR128DA48 #####
##### Wire Defaults #####

#avrda.build.wire.mode=MORS_BOTH 
#avrda.build.wireabr=.wO2 

##### printf defaults #####

#avrda.build.printf=-Wl,-u,vfprintf -lprintf_min
#avrda.build.printfabr=.pfM

##### AVR128DB48 #####
##### Wire Defaults #####

#avrdb.build.wire.mode=MORS_BOTH
#avrdb.build.wireabr=.wO2

##### printf defaults #####

#avrdb.build.printf=-Wl,-u,vfprintf -lprintf_min
#avrdb.build.printfabr=.pfM

################################ End OPTION 1 ##################################

#############
# Option 2  #
#############
########## OPTION 2 (Standard sub-menu options) ################################

##### BOARD NAMES #####

#avrda.name=AVR128DA48 Curiosity Nano
#avrdb.name=AVR128DB48 Curiosity Nano

##### AVR128DA48 #####

#menu.wire=Wire
#avrda.menu.wire.mors1=1x Wire, Master or Slave (least Flash & RAM)
#avrda.menu.wire.mors1.build.wire.mode=MORS_SINGLE
#avrda.menu.wire.mors1.build.wireabr=.wO
#avrda.menu.wire.mors2=2x Wire, Master or Slave (not available on 28-pin devices)
#avrda.menu.wire.mors2.build.wire.mode=MORS_BOTH
#avrda.menu.wire.mors2.build.wireabr=.wO2

#menu.printf=printf()
#avrda.menu.printf.minimal=Minimal, 1.1k flash used (Default)
#avrda.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
#avrda.menu.printf.minimal.build.printfabr=.pfM
#avrda.menu.printf.default=1.5k flash, no floats
#avrda.menu.printf.full=Full, 2.6k, prints floats
#avrda.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
#avrda.menu.printf.full.build.printfabr=.pfF


################################ End OPTION 2 ############################################

