Emsloan/arduino-tests/Boards Menu Options/boards.txt
##### 2x Wire, No Float #####
#avrda4.build.wire.mode=MORS_BOTH
#avrda4.build.wireabr=.wO2

##### 1x Wire, Full Float #####
#avrda5.build.wire.mode=MORS_SINGLE
#avrda5.build.wireabr=.wO
#avrda5.build.printf=-Wl,-u,vfprintf -lprintf_flt
#avrda5.build.printfabr=.pfF

##### 2x Wire, Full Float #####
#avrda6.build.wire.mode=MORS_BOTH
#avrda6.build.wireabr=.wO2
#avrda6.build.printf=-Wl,-u,vfprintf -lprintf_flt
#avrda6.build.printfabr=.pfF

################################ End OPTION 3 ##################################

#############
# Option 4  #
#############
########## OPTION 4 (New options under 'Chip' sub-menu) ################################

##### BOARD NAMES #####

avrda.name=AVR128DA48 Curiosity Nano
avrdb.name=AVR128DB48 Curiosity Nano


##### avrda Default settings for all #####
avrda.upload.tool=avrdude
avrda.upload.prog_interlock=
avrda.build.board=avrda
avrda.build.core=dxcore
avrda.build.text_section_start=.text=0x0
avrda.build.export_merged_output=false
avrda.build.mcupostfix=
avrda.build.printf=
avrda.build.printfabr=
avrda.build.attachabr=
avrda.build.wireabr=
avrda.build.appspmabr=.spm{bootloader.CODESIZE}
avrda.bootloader.tool=avrdude
avrda.bootloader.WDTCFG=0x00
avrda.bootloader.BODCFG={bootloader.bodlevbits}{bootloader.bodmodebits}
avrda.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrda.bootloader.CODESIZE=0x00
avrda.bootloader.BOOTSIZE=0x01
avrda.bootloader.avrdudestring=
avrda.bootloader.pymcuprogstring=-aerase
avrda.bootloader.appspm=
avrda.bootloader.BOOTSIZE=0x00
avrda.build.f_cpu=24000000L
avrda.build.speed=24
avrda.bootloader.bodlevbits=000
avrda.bootloader.eesavebit=1
avrda.bootloader.resetpinbits=10
avrda.bootloader.SYSCFG1=0x04

##### Settings for different option Combinations #####

##### 1x Wire, Minimal Float #####
avrda.menu.chip.128DA48_1=AVR128DA48 (1x Wire, Minimal Float)
avrda.menu.chip.128DA48_1.build.mcu=avr128da48
avrda.menu.chip.128DA48_1.upload.maximum_size=131072
avrda.menu.chip.128DA48_1.upload.maximum_data_size=16384
avrda.menu.chip.128DA48_1.build.variant=48pin-standard
avrda.menu.chip.128DA48_1.build.wire.mode=MORS_SINGLE
avrda.menu.chip.128DA48_1.build.wireabr=.wO
avrda.menu.chip.128DA48_1.build.printf=-Wl,-u,vfprintf -lprintf_min
avrda.menu.chip.128DA48_1.build.printfabr=.pfM

##### 2x Wire, Minimal Float #####
avrda.menu.chip.128DA48_2=AVR128DA48 (2x Wire, Minimal Float)
avrda.menu.chip.128DA48_2.build.mcu=avr128da48
avrda.menu.chip.128DA48_2.upload.maximum_size=131072
avrda.menu.chip.128DA48_2.upload.maximum_data_size=16384
avrda.menu.chip.128DA48_2.build.variant=48pin-standard
avrda.menu.chip.128DA48_2.build.wire.mode=MORS_BOTH
avrda.menu.chip.128DA48_2.build.wireabr=.wO2
avrda.menu.chip.128DA48_2.build.printf=-Wl,-u,vfprintf -lprintf_min
avrda.menu.chip.128DA48_2.build.printfabr=.pfM

##### 1x Wire, No Float #####
avrda.menu.chip.128DA48_3=AVR128DA48 (1x Wire, No Float)
avrda.menu.chip.128DA48_3.build.mcu=avr128da48
avrda.menu.chip.128DA48_3.upload.maximum_size=131072
avrda.menu.chip.128DA48_3.upload.maximum_data_size=16384
avrda.menu.chip.128DA48_3.build.variant=48pin-standard
avrda.menu.chip.128DA48_3.build.wire.mode=MORS_SINGLE
avrda.menu.chip.128DA48_3.build.wireabr=.wO

##### 2x Wire, No Float #####
avrda.menu.chip.128DA48_4=AVR128DA48 (2x Wire, No Float)
avrda.menu.chip.128DA48_4.build.mcu=avr128da48
avrda.menu.chip.128DA48_4.upload.maximum_size=131072
avrda.menu.chip.128DA48_4.upload.maximum_data_size=16384
avrda.menu.chip.128DA48_4.build.variant=48pin-standard
avrda.menu.chip.128DA48_4.build.wire.mode=MORS_BOTH
avrda.menu.chip.128DA48_4.build.wireabr=.wO2

##### 1x Wire, Full Float #####
avrda.menu.chip.128DA48_5=AVR128DA48 (1x Wire, Full Float)
avrda.menu.chip.128DA48_5.build.mcu=avr128da48
avrda.menu.chip.128DA48_5.upload.maximum_size=131072
avrda.menu.chip.128DA48_5.upload.maximum_data_size=16384
avrda.menu.chip.128DA48_5.build.variant=48pin-standard
avrda.menu.chip.128DA48_5.build.wire.mode=MORS_SINGLE
avrda.menu.chip.128DA48_5.build.wireabr=.wO
avrda.menu.chip.128DA48_5.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrda.menu.chip.128DA48_5.build.printfabr=.pfF

##### 2x Wire, Full Float #####
avrda.menu.chip.128DA48_6=AVR128DA48 (2x Wire, Full Float)
avrda.menu.chip.128DA48_6.build.mcu=avr128da48
avrda.menu.chip.128DA48_6.upload.maximum_size=131072
avrda.menu.chip.128DA48_6.upload.maximum_data_size=16384
avrda.menu.chip.128DA48_6.build.variant=48pin-standard
avrda.menu.chip.128DA48_6.build.wire.mode=MORS_BOTH
avrda.menu.chip.128DA48_6.build.wireabr=.wO2
avrda.menu.chip.128DA48_6.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrda.menu.chip.128DA48_6.build.printfabr=.pfF

################################ End OPTION 4 ##################################
